

//___________________________________________________________________________________________________________________________

// Ctrl + / комментарии (добавить/убрать)

//___________________________________________________________________________________________________________________________

//___________________________________________________________________________________________________________________________

// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// a = 5; b = 7 -> max = 7
//___________________________________________________________________________________________________________________________

Console.Write("Введите число 1 - ");
int num1 = int.Parse(Console.ReadLine());
Console.Write("Введите число 2 - ");
int num2 = int.Parse(Console.ReadLine());
if  (num1 >= num2)
{
Console.WriteLine("мах = " + num1);
}
else
{
Console.WriteLine("мах = " + num2);
}


//___________________________________________________________________________________________________________________________

// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// 44 5 78 -> 78
//___________________________________________________________________________________________________________________________

Console.Write("Введите число 1 - ");
int num1 = int.Parse(Console.ReadLine());
Console.Write("Введите число 2 - ");
int num2 = int.Parse(Console.ReadLine());
Console.Write("Введите число 3 - ");
int num3 = int.Parse(Console.ReadLine());
int max = 0;
 if (num1 >= num2 && num1 >= num3)
{
    max = num1;
}
else if (num2 >= num1 && num2 >=num3 )
    {
    max = num2;
    } 
else if (num3 >= num1 && num3 >= num2)
    {
    max = num3;
    }
Console.WriteLine("Максимальное число - " + max);


//___________________________________________________________________________________________________________________________

// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// 4 -> да
// -3 -> нет
// 7 -> нет
//___________________________________________________________________________________________________________________________

Console.Write("Введите число - ");
int num1 = int.Parse(Console.ReadLine());
if  (num1 % 2 == 0)
{
Console.WriteLine(num1 + " -> да");
}
else
{
Console.WriteLine(num1 + " -> нет");
}

//___________________________________________________________________________________________________________________________

// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

// 5 -> 2, 4
// 8 -> 2, 4, 6, 8
//___________________________________________________________________________________________________________________________

Console.Write("Введите число N - ");
int num1 = int.Parse(Console.ReadLine());
Console.Write(num1 + " -> "); 
for (int StartPosition = 1; StartPosition <= num1; StartPosition++)    
if (StartPosition % 2 == 0) 
Console.Write(StartPosition + ", ");
